import React from 'react';
import styles from './Cart.module.scss';

import { useDispatch } from 'react-redux';
import { clearCart } from '../../redux/itemsSlice';

const ClearCart = () => {
  const dispatch = useDispatch();
  return (
    <div className={styles.clear}>
      <div
        className={styles.clear__inner}
        onClick={() => dispatch(clearCart())}
      >
        <div className="clear__ico">
          <svg
            width="24"
            height="25"
            viewBox="0 0 24 25"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              opacity="0.4"
              d="M19.6433 9.87653C19.6433 9.94479 19.1104 16.7113 18.806 19.5591C18.6154 21.3067 17.493 22.3667 15.8095 22.3968C14.516 22.4259 13.2498 22.4359 12.0039 22.4359C10.6813 22.4359 9.38778 22.4259 8.13221 22.3968C6.50513 22.3576 5.38183 21.2766 5.20094 19.5591C4.88778 16.7013 4.36454 9.94479 4.35482 9.87653C4.34509 9.67075 4.41123 9.47501 4.54544 9.31641C4.67771 9.16986 4.86833 9.08153 5.06867 9.08153H18.9392C19.1386 9.08153 19.3195 9.16986 19.4624 9.31641C19.5957 9.47501 19.6628 9.67075 19.6433 9.87653Z"
              fill="#FE5E00"
            />
            <path
              d="M21 6.35153C21 5.93897 20.6761 5.61575 20.2871 5.61575H17.3714C16.7781 5.61575 16.2627 5.19215 16.1304 4.5949L15.967 3.86313C15.7385 2.9788 14.9498 2.35946 14.0647 2.35946H9.93624C9.0415 2.35946 8.26054 2.9788 8.02323 3.91132L7.87054 4.5959C7.7373 5.19215 7.22185 5.61575 6.62957 5.61575H3.71385C3.32386 5.61575 3 5.93897 3 6.35153V6.73297C3 7.13549 3.32386 7.46874 3.71385 7.46874H20.2871C20.6761 7.46874 21 7.13549 21 6.73297V6.35153Z"
              fill="#FE5E00"
            />
          </svg>
        </div>
        <div className="clear__text">
          <p>Очистить корзину</p>
        </div>
      </div>
    </div>
  );
};

export default ClearCart;
